<a href="https://colab.research.google.com/github/thavha/Regression-predict-group-5/blob/master/regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Data Preprocessing**
Importing Liabraries

In [0]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

**Importing the data set** and checking the data

In [0]:
dataset = pd.read_csv('Train.csv')
###x =dataset.iloc[:,:-1].values
###y = dataset.iloc[:,-1].values

In [19]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21201 entries, 0 to 21200
Data columns (total 29 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   Order No                                   21201 non-null  object
 1   User Id                                    21201 non-null  object
 2   Vehicle Type                               21201 non-null  object
 3   Platform Type                              21201 non-null  int64
 4   Personal or Business                       21201 non-null  object
 5   Placement - Day of Month                   21201 non-null  int64
 6   Placement - Weekday (Mo = 1)               21201 non-null  int64
 7   Placement - Time                           21201 non-null  object
 8   Confirmation - Day of Month                21201 non-null  int64
 9   Confirmation - Weekday (Mo = 1)            21201 non-null  int64
 10  Confirmation - Time                        21201 non-null  object
 11  Arrival at Pickup - Day of Month           21201 non-null  int64
 12  Arrival at Pickup - Weekday (Mo = 1)       21201 non-null  int64
 13  Arrival at Pickup - Time                   21201 non-null  object
 14  Pickup - Day of Month                      21201 non-null  int64
 15  Pickup - Weekday (Mo = 1)                  21201 non-null  int64
 16  Pickup - Time                              21201 non-null  object
 17  Arrival at Destination - Day of Month      21201 non-null  int64
 18  Arrival at Destination - Weekday (Mo = 1)  21201 non-null  int64
 19  Arrival at Destination - Time              21201 non-null  object
 20  Distance (KM)                              21201 non-null  int64
 21  Temperature                                16835 non-null  float64
 22  Precipitation in millimeters               552 non-null    float64
 23  Pickup Lat                                 21201 non-null  float64
 24  Pickup Long                                21201 non-null  float64
 25  Destination Lat                            21201 non-null  float64
 26  Destination Long                           21201 non-null  float64
 27  Rider Id                                   21201 non-null  object
 28  Time from Pickup to Arrival                21201 non-null  int64
dtypes: float64(6), int64(13), object(10)
memory usage: 4.7+ MB

selecting only the rlevent  columns that will be used for the model and replacing white space with _ on columns names

In [0]:
new_df = dataset[['User Id','Platform Type','Personal or Business','Placement - Day of Month','Placement - Weekday (Mo = 1)','Placement - Time','Confirmation - Time','Arrival at Pickup - Time','Arrival at Destination - Time','Distance (KM)','Temperature','Rider Id','Time from Pickup to Arrival']].copy()
new_df.columns = [col.replace(" ","_") for col in new_df.columns]

In [21]:
new_df.head()

        User_Id  Platform_Type  ...      Rider_Id  Time_from_Pickup_to_Arrival
0   User_Id_633              3  ...  Rider_Id_432                          745
1  User_Id_2285              3  ...  Rider_Id_856                         1993
2   User_Id_265              3  ...  Rider_Id_155                          455
3  User_Id_1402              3  ...  Rider_Id_855                         1341
4  User_Id_1737              1  ...  Rider_Id_770                         1214

[5 rows x 13 columns]

encoding personal or business column

In [22]:
new_df = pd.get_dummies(new_df, columns=['Personal_or_Business'], prefix = ['personal'])
new_df = new_df.iloc[:, :-1]
new_df.columns = [*new_df.columns[:-1], 'Business']
new_df.head()

        User_Id  Platform_Type  ...  Time_from_Pickup_to_Arrival  Business
0   User_Id_633              3  ...                          745         1
1  User_Id_2285              3  ...                         1993         0
2   User_Id_265              3  ...                          455         1
3  User_Id_1402              3  ...                         1341         1
4  User_Id_1737              1  ...                         1214         0

[5 rows x 13 columns]

dealing with the missing valuse replace with the mean/median temperature

In [23]:
new_df['Temperature'] = new_df.Temperature.fillna(new_df.Temperature.median())
new_df.head()

        User_Id  Platform_Type  ...  Time_from_Pickup_to_Arrival  Business
0   User_Id_633              3  ...                          745         1
1  User_Id_2285              3  ...                         1993         0
2   User_Id_265              3  ...                          455         1
3  User_Id_1402              3  ...                         1341         1
4  User_Id_1737              1  ...                         1214         0

[5 rows x 13 columns]

dealing with time columns

In [0]:
new_df['Placement_-_Time 24'] = (pd.to_datetime(new_df['Placement_-_Time'].str.strip(), format='%I:%M:%S %p')
                  .dt.strftime('%H:%M'))
new_df['Confirmation_-_Time 24'] = (pd.to_datetime(new_df['Confirmation_-_Time'].str.strip(), format='%I:%M:%S %p')
                  .dt.strftime('%H:%M'))
new_df['Arrival_at_Pickup_-_Time 24'] = (pd.to_datetime(new_df['Arrival_at_Pickup_-_Time'].str.strip(), format='%I:%M:%S %p')
                  .dt.strftime('%H:%M'))
new_df['Arrival_at_Destination_-_Time 24'] = (pd.to_datetime(new_df['Arrival_at_Destination_-_Time'].str.strip(), format='%I:%M:%S %p')
                  .dt.strftime('%H:%M'))

In [29]:
new_df.head()

        User_Id  ...  Arrival_at_Destination_-_Time 24
0   User_Id_633  ...                             10:39
1  User_Id_2285  ...                             12:17
2   User_Id_265  ...                             13:00
3  User_Id_1402  ...                             10:05
4  User_Id_1737  ...                             10:25

[5 rows x 17 columns]

In [30]:
new_df.drop(['Placement_-_Time', 'Confirmation_-_Time','Arrival_at_Pickup_-_Time','Arrival_at_Destination_-_Time'], axis=1)

            User_Id  ...  Arrival_at_Destination_-_Time 24
0       User_Id_633  ...                             10:39
1      User_Id_2285  ...                             12:17
2       User_Id_265  ...                             13:00
3      User_Id_1402  ...                             10:05
4      User_Id_1737  ...                             10:25
...             ...  ...                               ...
21196  User_Id_2001  ...                             16:20
21197  User_Id_1796  ...                             10:46
21198  User_Id_2956  ...                             18:40
21199  User_Id_2524  ...                             10:08
21200   User_Id_718  ...                             15:17

[21201 rows x 13 columns]